# Taps
tap "1password/tap"

# CLI tools
brew "automake"
brew "bat"
brew "composer"
brew "coreutils"
brew "ffmpeg"
brew "git"
brew "imagemagick"
brew "mas"
brew "node"
brew "openssh"
brew "openssl"
brew "pure"
brew "qemu"
brew "rbenv"
brew "ruby-build"
brew "shellcheck"
brew "webp"
brew "youtube-dl"
brew "zopfli"
brew "zsh-autosuggestions"

# Fonts
cask "font-atkinson-hyperlegible"
cask "font-ia-writer-mono"
cask "font-ia-writer-duo"
cask "font-ia-writer-quattro"
cask "font-ibm-plex"
cask "font-inter"
cask "font-lato"

# Applications
cask "1password"
cask "1password-cli"
cask "adobe-acrobat-pro"
cask "asana"
cask "box-drive"
cask "calibre"
cask "cleanmymac"
cask "cleanshot"
cask "colour-contrast-analyser"
cask "cursor"
cask "cyberduck"
cask "daisydisk"
cask "deltawalker"
cask "docker"
cask "downie"
cask "firefox"
cask "firefox@developer-edition"
cask "gemini"
cask "github"
cask "google-chrome"
cask "google-drive"
cask "grammarly-desktop"
cask "handbrake"
cask "imageoptim"
cask "inkscape"
cask "iterm2"
cask "karabiner-elements"
cask "keyboard-maestro"
cask "little-snitch"
cask "lm-studio"
cask "macai"
cask "macupdater"
cask "macwhisper"
cask "microsoft-office"
cask "mullvadvpn"
cask "obsidian"
cask "ollama"
cask "parallels"
cask "piezo"
cask "pika"
cask "polypane"
cask "raycast"
cask "screaming-frog-seo-spider"
cask "screenflow"
cask "slack"
cask "spotify"
cask "superduper"
cask "tower"
cask "visual-studio-code"
cask "vivaldi"
cask "zoom"

# Mac App Store Applications
mas "Acorn 7", id: 1547371478
mas "Amphetamine", id: 937984704
mas "Exporter", id: 1099120373
mas "Fantastical", id: 975937182
mas "GarageBand", id: 682658836
mas "Hidden Bar", id: 1452453066
mas "iA Writer", id: 775737590
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "NotePlan", id: 1505432629
mas "Numbers", id: 409203825
mas "OmniFocus 4", id: 1542143627
mas "Pages", id: 409201541
mas "Parcel", id: 639968404
mas "Permute 3", id: 1444998321
mas "PhotoSweeper", id: 463362050
mas "Pixelmator Pro", id: 1289583905
mas "Reeder 5", id: 1529448980
mas "Sequel Ace", id: 1518036000
mas "Site Sucker", id: 442168834
mas "Stop the Madness Pro", id: 6471380298
mas "Things 3", id: 904280696
