# Taps
tap "1password/tap"

# CLI tools
brew "automake"
brew "bat"
brew "composer"
brew "coreutils"
brew "ffmpeg"
brew "gh"
brew "git"
brew "gnupg"
brew "imagemagick"
brew "mas"
brew "node"
brew "openssh"
brew "openssl"
brew "pandoc"
brew "pure"
brew "python"
brew "qemu"
brew "rbenv"
brew "repomix"
brew "ruby-build"
brew "shellcheck"
brew "webp"
brew "youtube-dl"
brew "zopfli"
brew "zsh-autosuggestions"

# Fonts
cask "font-atkinson-hyperlegible"
cask "font-ia-writer-mono"
cask "font-ia-writer-duo"
cask "font-ia-writer-quattro"
cask "font-ibm-plex"
cask "font-inter"
cask "font-lato"

# Applications
cask "1password"
cask "1password-cli"
cask "adobe-acrobat-pro"
cask "asana"
cask "box-drive"
cask "calibre"
cask "claude"
cask "cleanmymac"
cask "cleanshot"
cask "colour-contrast-analyser"
cask "cyberduck"
cask "daisydisk"
cask "docker-desktop"
cask "downie"
cask "firefox@developer-edition"
cask "gemini"
cask "github"
cask "google-chrome"
cask "grammarly-desktop"
cask "handbrake-app"
cask "imageoptim"
cask "iterm2"
cask "karabiner-elements"
cask "keyboard-maestro"
cask "little-snitch"
cask "macupdater"
cask "macwhisper"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "mullvad-vpn"
cask "nova"
cask "obsidian"
cask "ollama-app"
cask "parallels"
cask "pika"
cask "polypane"
cask "raycast"
cask "screaming-frog-seo-spider"
cask "slack"
cask "spotify"
cask "superduper"
cask "tailscale-app"
cask "tower"
cask "transmit"
cask "visual-studio-code"
# cask "vmware-fusion" 2025-06-23 requires authentication to download
cask "void"
cask "zoom"

# Mac App Store Applications
mas "Amphetamine", id: 937984704
mas "Exporter", id: 1099120373
mas "Fantastical", id: 975937182
mas "GarageBand", id: 682658836
mas "Hidden Bar", id: 1452453066
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "OmniFocus 4", id: 1542143627
mas "Pages", id: 409201541
mas "Parcel", id: 639968404
mas "Permute 3", id: 1444998321
mas "Pixelmator Pro", id: 1289583905
mas "Reeder 5", id: 1529448980
mas "Say No to Notch", id: 1639306886
mas "Screens 5", id: 1663047912
mas "Sequel Ace", id: 1518036000
mas "Things 3", id: 904280696
mas "Xcode", id: 497799835
